puts "=================================================="
puts "  ЛАБОРАТОРНА РОБОТА №2 (Варіант 30)"
puts "=================================================="
puts

load File.join(__dir__, "block1.rb")
puts "--------------------------------------------------"
load File.join(__dir__, "block2.rb")
puts "--------------------------------------------------"
load File.join(__dir__, "block3_task4.rb")
puts "--------------------------------------------------"
load File.join(__dir__, "block3_task5.rb")
puts "=================================================="
puts "  Усі завдання виконано успішно!"
puts "=================================================="
